# Project 3 - Part 3 - Database ETL

- Name: Tyler Schelling
- Date Started: 1/17/2023

---

## Specifications - Database

- Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project, and wants you to create a MySQL database for them.

- Specifically, they want the data from the following files included in your database:
    - Title Basics:
        - Movie ID (tconst)
        - Primary Title
        - Start Year
        - Runtime (in Minutes)
        - Genres
    - Title Ratings
        - Movie ID (tconst)
        - Average Movie Rating
        - Number of Votes
    - The TMDB API Results (multiple files)
        - Movie ID
        - Revenue
        - Budget
        - Certification (MPAA Rating)
- You should normalize the tables as best you can before adding them to your new database.
    - Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).
    - You only need to keep the imdb_id, revenue, budget, and certification columns

## Import Libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import json

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy import create_engine

## Normalize Genres

### title_genres Dataframe

In [2]:
#Load the dataframe from the csv file
title_basics_df = pd.read_csv('Data/title_basics.csv.gz')

#Display the first 5 rows
title_basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [3]:
#Save tconst and genres to new df
title_genres_df = title_basics_df[['tconst']].copy()
title_genres_df['genres split'] = title_basics_df['genres'].str.split(',')

#Display the first 5 rows
title_genres_df.head()

      tconst                genres split
0  tt0035423  [Comedy, Fantasy, Romance]
1  tt0062336                     [Drama]
2  tt0069049                     [Drama]
3  tt0088751    [Comedy, Horror, Sci-Fi]
4  tt0096056                     [Drama]

In [4]:
#Update the df to have unique lines for each genre
title_genres_df = title_genres_df.explode('genres split')

#Display the first 5 rows
title_genres_df.head()

      tconst genres split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [5]:
#Create a dictionary of unique genres of keys and apply an integer as the value
unique_genres = sorted(title_genres_df['genres split'].unique())
genre_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [6]:
#Map the genre_id to the genre names and drop the genres split column
title_genres_df['genre_id'] = title_genres_df['genres split'].map(genre_map)
title_genres_df.drop(columns = 'genres split', inplace = True)

#Display the first 5 rows
title_genres_df.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

### genres Dataframe

In [7]:
#Create a dataframe from the genre_map dictionary
genres_df = pd.DataFrame({'genre_name': genre_map.keys(), 
                          'genre_id': genre_map.values()})

#Display the first 5 rows
genres_df.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Update title_basics

In [8]:
#Display dataframe info
title_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84127 entries, 0 to 84126
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          84127 non-null  object
 1   titleType       84127 non-null  object
 2   primaryTitle    84127 non-null  object
 3   originalTitle   84127 non-null  object
 4   isAdult         84127 non-null  int64
 5   startYear       84127 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  84127 non-null  int64
 8   genres          84127 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 5.8+ MB

In [9]:
#Drop columns from the dataframe
#"titleType": every row will be a movie
#"original_title": we will use the primary title column instead
#"isAdult": "Adult" will show up in the genres so this is redundant information
#"endYear": all rows are NaN
#"genres": genre is now represented in the 2 new tables described in 3.3
title_basics_df = title_basics_df.drop(columns = ['titleType', 'originalTitle',
                                                  'isAdult', 'endYear', 'genres'])

In [10]:
#Display dataframe info
title_basics_df.info()

#Display the first 5 rows
title_basics_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84127 entries, 0 to 84126
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          84127 non-null  object
 1   primaryTitle    84127 non-null  object
 2   startYear       84127 non-null  int64
 3   runtimeMinutes  84127 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.6+ MB

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

## Create SQL Movies Database

In [11]:
#Obtain the MySQL login username and password
with open('/Users/tyler/.secret/mysql.json') as f:
    login = json.load(f)
#Display the MySQL login keys
login.keys()

dict_keys(['username', 'password'])

In [12]:
#Create a connection string using credentials above
from urllib.parse import quote_plus as urlquote
database_name = "Movies"
connection = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/{database_name}"

In [13]:
#Create an instance of sqlalchemy 
engine = create_engine(connection)

#Create the Movies database, if it does not already exist
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

### title_basics SQL Table

In [14]:
#Create a schema dictonary using datatype objects
df_schema = {
    'tconst': String(title_basics_df['tconst'].str.len().max()),
    'primaryTitle': Text(title_basics_df['primaryTitle'].str.len().max()),
    'startYear': Integer(),
    'runtimeMinutes': Integer()}

#Save the dataframe to an sql table
title_basics_df.to_sql('title_basics',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

84127

In [15]:
#Use the engine to update title_basics with a primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [16]:
#Display the first 5 rows of the table using an SQL query.
q = """
SELECT * 
FROM title_basics LIMIT 5
;"""

pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

### title_ratings SQL Table

In [17]:
#Load the dataframe from the csv file
title_ratings_df = pd.read_csv('Data/title_ratings.csv.gz')

#Display the first 5 rows
title_ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1929
1  tt0000002            5.8       261
2  tt0000005            6.2      2559
3  tt0000006            5.1       175
4  tt0000007            5.4       797

In [18]:
#Create a schema dictonary using datatype objects
df_schema = {
    "tconst": String(title_ratings_df['tconst'].str.len().max()), 
    'averageRating':Float(),
    'numVotes':Integer()}

#Save the dataframe to an sql table
title_ratings_df.to_sql('title_ratings',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

479287

In [19]:
#Use the engine to update title_basics with a primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [20]:
#Display the first 5 rows of the table using a SQL query
q = """
SELECT * 
FROM title_ratings LIMIT 5
;"""

pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1929
1  tt0000002            5.8       261
2  tt0000005            6.2      2559
3  tt0000006            5.1       175
4  tt0000007            5.4       797

### title_genres SQL Table

In [21]:
#Display the first 5 rows
title_genres_df.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [22]:
#Create a schema dictonary using datatype objects
df_schema = {
    "tconst": String(title_genres_df['tconst'].str.len().max()), 
    'genre_id':Integer()}

#Save the dataframe to an sql table
title_genres_df.to_sql('title_genres',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

157205

In [23]:
#Display the first 5 rows of the table using a SQL query
q = """
SELECT * 
FROM title_genres LIMIT 5
;"""

pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

### genres SQL Table

In [24]:
#Display the first 5 rows
genres_df.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [25]:
#Create a schema dictonary using datatype objects
df_schema = {
    "genre_id": Integer(), 
    'genre_name': String(genres_df['genre_name'].str.len().max())}

#Save the dataframe to an sql table
genres_df.to_sql('genres',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

26

In [26]:
#Use the engine to update title_basics with a primary key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [27]:
#Display the first 5 rows of the table using an SQL query
q = """
SELECT * 
FROM genres LIMIT 5
;"""

pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### tmdb_data SQL Table

In [28]:
#Load the dataframe from the csv file
tmdb_data_df = pd.read_csv('Data/tmdb_results_combined.csv.gz')

#Display the first 5 rows
tmdb_data_df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.109,2058.0,PG

In [29]:
#Drop irrelevant columns
tmdb_data_df = tmdb_data_df.loc[:,["imdb_id","revenue",'budget','certification']]
tmdb_data_df.drop(0, inplace=True, axis=0)

#Display the first 5 rows
tmdb_data_df.head()

     imdb_id     revenue      budget certification
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG
5  tt0118852         0.0         0.0             R

In [30]:
#Create a schema dictonary using datatype objects
df_schema = {
    'imdb_id': String(tmdb_data_df['imdb_id'].str.len().max()), 
    'budget':Float(),
    'revenue':Float(),
    'certification': String(tmdb_data_df['certification'].str.len().max())}

#Save the dataframe to an sql table
tmdb_data_df.to_sql('tmdb_data',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

2507

In [31]:
#Use the engine to update title_basics with a primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [32]:
#Display the first 5 rows of the table using an SQL query
q = """
SELECT * 
FROM tmdb_data LIMIT 5
;"""

pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0          0         NaN         NaN          None
1  tt0035423  76019000.0  48000000.0         PG-13
2  tt0113026         0.0  10000000.0          None
3  tt0113092         0.0         0.0          None
4  tt0114447         0.0         0.0          None

## Show SQL Tables

In [33]:
#Display the SQL table names using an SQL query
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data